import React from 'react';
import {CgProfile} from "react-icons/cg";
import {Button} from "react-bootstrap";
import {Link, useNavigate} from "react-router-dom";
import {useDispatch, useSelector} from "react-redux";
import {userSelector} from "../../redux/reselect";
import {logOutUser} from "../../redux/reducers/user";

const Header = () => {

    const navigate = useNavigate()
    const {user} = useSelector(userSelector)
    const dispatch = useDispatch()

    return (
        <div className='header__line'>
            <div className="container">
                <div className='header'>
                    <div className="header__logo">
                        <svg width="156" height="24" viewBox="0 0 156 24" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M0.447996 2.275C0.158996 3.027 0.0529957 8 0.211996 13.326C0.510996 23.364 2.269 27.084 2.802 18.807C3.101 14.182 3.158 14.11 6.802 13.807C11.615 13.407 11.579 11.589 6.75 11.19C3.215 10.897 3 10.685 3 7.49V4.09999L8.512 3.8C16.384 3.372 15.842 1.55899 7.736 1.20399C2.727 0.984995 0.835996 1.263 0.447996 2.275ZM20.43 2.321C20.151 3.048 20.053 8.11 20.212 13.571L20.5 23.5H26.417C30.261 23.5 32.479 23.062 32.75 22.25C33.047 21.359 31.706 21 28.083 21H23V11C23 4.797 22.608 0.999996 21.969 0.999996C21.401 0.999996 20.709 1.595 20.43 2.321ZM40.217 12.204L40.5 23.5H46.75C54.483 23.5 55.108 21.613 47.512 21.2L42 20.9V17.51C42 14.329 42.226 14.102 45.673 13.81C50.948 13.365 51.294 11 46.083 11C42.095 11 42 10.92 42 7.55V4.09999L47.512 3.8C55.394 3.371 54.839 1.55899 46.717 1.20399L39.934 0.906998L40.217 12.204ZM60 2.07C60 2.658 61.417 5.199 63.149 7.716C65.938 11.771 66.147 12.533 64.976 14.397C60.942 20.814 59.995 22.879 60.841 23.402C61.356 23.72 63.122 21.911 64.767 19.383L67.757 14.786L70.941 19.414C72.692 21.959 74.566 23.768 75.106 23.435C75.684 23.077 75.226 21.528 73.99 19.664C69.407 12.752 69.371 12.346 72.898 7.34299C74.932 4.45599 75.789 2.389 75.197 1.797C74.605 1.205 73.181 2.544 71.376 5.39C69.794 7.885 68.275 9.943 68 9.962C67.725 9.981 66.221 7.972 64.658 5.498C61.944 1.203 60 -0.228004 60 2.07ZM84.217 12.25L84.5 23.5H89.917C93.361 23.5 95.485 23.045 95.75 22.25C96.047 21.359 94.706 21 91.083 21H86V11C86 4.789 85.609 0.999996 84.967 0.999996C84.301 0.999996 84.035 4.996 84.217 12.25ZM130.032 2.191C130.1 4.993 135.793 22.431 136.743 22.748C137.295 22.932 138.8 19.271 140.085 14.613C141.37 9.95399 142.727 6.331 143.1 6.562C143.473 6.792 144.082 8.223 144.453 9.741C146.532 18.25 148.295 23.068 149.218 22.761C150.196 22.435 155.898 5.057 155.968 2.191C156.05 -1.174 154.079 2.698 152.009 9.967C150.751 14.385 149.335 18 148.861 18C148.387 18 148.001 17.438 148.003 16.75C148.009 14.433 143.716 0.999996 142.969 0.999996C142.562 0.999996 141.174 4.825 139.884 9.5C138.594 14.175 137.276 18 136.956 18C136.635 18 135.33 14.39 134.055 9.978C131.956 2.715 129.95 -1.168 130.032 2.191ZM107.005 11.586C104.163 16.858 102.02 21.353 102.242 21.575C103.061 22.395 107 17.861 107 16.099C107 15.096 108.35 12.576 110 10.5C112.488 7.37 114.122 2 112.586 2C112.359 2 109.847 6.31299 107.005 11.586ZM114 4.448C114 5.795 115.156 8.14399 116.569 9.66899C117.982 11.194 119.382 13.66 119.68 15.151C120.174 17.618 125 23.422 125 21.548C125 20.504 114.996 2 114.432 2C114.194 2 114 3.102 114 4.448ZM104.605 22.3C103.106 23.395 104.494 23.592 113.432 23.55C122.169 23.509 123.735 23.28 122.327 22.25C120.03 20.57 106.919 20.607 104.605 22.3Z"
                                  fill="black"/>
                        </svg>

                    </div>
                    <ul className="header__menu">
                        <Link className="header__menu-link" to={'/'}>Главная</Link>
                        <Link className="header__menu-link" to={'/petitions'}>Петиция</Link>
                        <li className="header__menu-link">Законы</li>
                        <li className="header__menu-link">О нас</li>
                    </ul>
                    <div className='header__language'>
                        <div className='header__language-ky'>кыр</div>
                        <span className='header__language-span'>/</span>
                        <div className='header__language-ru header__language-active'>рус</div>
                    </div>

                    {
                        user.inn ?
                            <div className='header__icon'>
                                <CgProfile/>
                                <Button
                                    variant={"outline-secondary"}
                                    onClick={() => dispatch(logOutUser())}
                                >Выйти</Button>
                            </div>
                            :
                            <div>
                                <Button onClick={() => navigate('/login')}>Войти</Button>
                            </div>
                    }


                </div>
            </div>
        </div>
    );
};

export default Header;